***messages***

:STRINGS

; These are strings for prompts proposing users to choose from several
; options defined by words. Every such word is started from _.
; In every word the first character not used yet by previous words
; is assigned as hotkey. It is necessary to make such character
; uppercase, so users will know what to enter for every choice.
MYesNo                         "_Co_Khong"
MYesNoAll                      "_Co_Khong_Tat ca"
MYesNoAllQ                     "_Co_Khong_Tat ca_kHong bao gio_thOat"
MYesNoAllRenQ                  "_Co_Khong_Tat ca_hHong bao gio_Doi ten_thOat"
MContinueQuit                  "_Tiep tuc_thOat"
MRetryAbort                    "_Thu lai_Huy bo"
MIgnoreAllRetryQuit            "_Bo qua_Tat ca_Thu lai_Thoat"

MCopyright                     "\nRAR %s   Ban quyen (c) 1993-%d Alexander Roshal   %d %s %d"
MRegTo                         "\nDuoc dang ky boi %s\n"
MShare                         "\nPhien ban thu nghiem         Go RAR -? de duoc tro giup\n"
MRegKeyWarning                 "\n Giay phep san pham co san cho %s\n"
MUCopyright                    "\nPhan mem mien phi UNRAR %s      Ban quyen (c) 1993-%d Alexander Roshal\n"
MBeta                          "Beta"
Mx86                           "x86"
Mx64                           "x64"
MMonthJan                      "Th1"
MMonthFeb                      "Th2"
MMonthMar                      "Th3"
MMonthApr                      "Th4"
MMonthMay                      "Th5"
MMonthJun                      "Th6"
MMonthJul                      "Th7"
MMonthAug                      "Th8"
MMonthSep                      "Th9"
MMonthOct                      "Th10"
MMonthNov                      "Th11"
MMonthDec                      "Th12"
MRARTitle1                     "\nCach dung:     rar <lenh> -<khoa 1> -<khoa N> <tap tin nen> <cac tap tin...>"
MUNRARTitle1                   "\nCach dung:     unrar <lenh> -<khoa 1> -<khoa N> <tap tin nen> <cac tap tin...>"
MRARTitle2                     "\n               <@ds_tap_tin...> <duong_dan_de_giai_nen\\>"
MFwrSlTitle2                   "\n               <@ds_tap_tin...> <duong_dan_de_giai_nen\\>"
MCHelpCmd                      "\n\n<Cac lenh>"
MCHelpCmdA                     "\n  a             Them cac tap tin vao tap tin nen"
MCHelpCmdC                     "\n  c             Them chu thich tap tin nen"
MCHelpCmdCH                    "\n  ch            Doi cac tham so tap tin nen"
MCHelpCmdCW                    "\n  cw            Ghi chu thich tap tin nen ra tap tin"
MCHelpCmdD                     "\n  d             Xoa cac tap tin khoi tap tin nen"
MCHelpCmdE                     "\n  e             Giai nen cac tap tin khong co cac duong dan da nen"
MCHelpCmdF                     "\n  f             Lam moi cac tap tin trong tap tin nen"
MCHelpCmdI                     "\n  i[ts]=<chuoi> Tim chuoi trong cac tap tin nen"
MCHelpCmdK                     "\n  k             Khoa tap tin nen"
MCHelpCmdL                     "\n  l[t[a],b]     Liet ke noi dung tap tin nen [(t)ky thuat[(a)tat ca], (b)vua du]"
MCHelpCmdM                     "\n  m[f]          Di chuyen vao tap tin nen [(f)chi cac tap tin]"
MCHelpCmdP                     "\n  p             In tap tin ra stdout"
MCHelpCmdR                     "\n  r             Sua chua tap tin nen"
MCHelpCmdRC                    "\n  rc            Xay dung lai cac phan bi mat"
MCHelpCmdRN                    "\n  rn            Doi ten cac tap tin da duoc nen"
MCHelpCmdRR                    "\n  rr[N]         Them ban ghi phuc hoi du lieu"
MCHelpCmdRV                    "\n  rv[N]         Tao nhung phan phuc hoi"
MCHelpCmdS                     "\n  s[ten|-]      Chuyen doi tap tin nen thanh hoac tu SFX"
MCHelpCmdT                     "\n  t             Kiem tra cac tap tin tap tin nen"
MCHelpCmdU                     "\n  u             Cap nhat cac tap tin trong tap tin nen"
MCHelpCmdV                     "\n  v[t[a],b]     Liet ke chi tiet tap tin nen [(t)ky thuat[(a)tat ca], (b)vua du]"
MCHelpCmdX                     "\n  x             Giai nen cac tap tin voi duong dan day du"
MCHelpSw                       "\n\n<Cac khoa>"
MCHelpSwm                      "\n  -             Dung viec quet cac khoa"
MCHelpSwAT                     "\n  @[+]          Vo hieu [ap dung] cac danh sach tap tin"
MCHelpSwAC                     "\n  ac            Xoa thuoc tinh Tap tin nen sau khi nen hoac giai nen"
MCHelpSwAD                     "\n  ad            Noi ten tap tin nen vao duong dan dich"
MCHelpSwAG                     "\n  ag[dinh dang] Sinh ten tap tin nen su dung ngay hien tai"
MCHelpSwAI                     "\n  ai            Bo qua cac thuoc tinh tap tin"
MCHelpSwAM                     "\n  am[s,r]       Ten va thoi gian [luu, khoiphuc]"
MCHelpSwAO                     "\n  ao            Them cac tap tin voi thuoc tinh Tap tin nen duoc dat"
MCHelpSwAP                     "\n  ap<dd>        Dat duong dan trong tap tin nen"
MCHelpSwAS                     "\n  as            Dong bo hoa noi dung tap tin nen"
MCHelpSwCm                     "\n  c-            Vo hieu viec hien thi cac chu thich"
MCHelpSwCFGm                   "\n  cfg-          Vo hieu viec doc cau hinh"
MCHelpSwCL                     "\n  cl            Chuyen cac ten thanh chu thuong"
MCHelpSwCU                     "\n  cu            Chuyen cac ten thanh chu hoa"
MCHelpSwDF                     "\n  df            Xoa cac tap tin sau khi nen"
MCHelpSwDH                     "\n  dh            Mo cac tap tin chia se"
MCHelpSwDR                     "\n  dr            Xoa cac tap tin vao Thung Rac"
MCHelpSwDS                     "\n  ds            Vo hieu viec sap xep ten cho tap tin nen dac"
MCHelpSwDW                     "\n  dw            Xoa sach cac tap tin sau khi nen"
MCHelpSwEa                     "\n  e[+]<attr>    Dat cac thuoc tinh loai tru va bao gom tap tin"
MCHelpSwED                     "\n  ed            Khong duoc them cac thu muc rong"
MCHelpSwEP                     "\n  ep            Loai tru cac duong dan khoi cac ten"
MCHelpSwEP1                    "\n  ep1           Loai tru thu muc co so khoi cac ten"
MCHelpSwEP2                    "\n  ep2           Mo rong cac duong dan thanh day du"
MCHelpSwEP3                    "\n  ep3           Mo rong cac duong dan thanh day du bao gom ky tu o dia"
MCHelpSwEP4                    "\n  ep4<path>     Loai tru tien to khoi ten"
MCHelpSwF                      "\n  f             Lam moi cac tap tin"
MCHelpSwHP                     "\n  hp[mat khau]  Ma hoa ca du lieu va cac phan dau muc tap tin"
MCHelpSwHT                     "\n  ht[b|c]       Chon loai hash [BLAKE2,CRC32] cho tong kiem tra tap tin"
MCHelpSwIDP                    "\n  id[c,d,p,q]   Vo hieu cac thong bao"
MCHelpSwIEML                   "\n  ieml[addr]    Gui tap tin nen bang email"
MCHelpSwIERR                   "\n  ierr          Gui tat ca cac thong bao den stderr"
MCHelpSwILOG                   "\n  ilog[ten]     Ghi nhan cac loi ra tap tin (chi cac phien ban da dang ky)"
MCHelpSwINUL                   "\n  inul          Vo hieu tat ca cac thong bao"
MCHelpSwIOFF                   "\n  ioff[n]          Tat PC sau khi hoan thanh mot thao tac"
MCHelpSwISND                   "\n  isnd[-]          Ap dung am thanh"
MCHelpSwIVER                   "\n  iver          Hien thi so phien ban"
MCHelpSwK                      "\n  k             Khoa tap tin nen"
MCHelpSwKB                     "\n  kb            Giu lai cac tap tin da giai nen bi hong"
MCHelpSwLog                    "\n  log[f][=ten]  Ghi cac tap tin ra tap tin ghi nhan"
MCHelpSwMn                     "\n  m<0..5>       Dat muc do nen (0-luu tru...3-mac dinh...5-toi da)"
MCHelpSwMC                     "\n  mc<ts>        Dat cac tham so nen nang cao"
MCHelpSwMD                     "\n  md<n>[k,m,g]  Kich thuoc tu dien theo KB, MB hay GB"
MCHelpSwME                     "\n  me[par]       Dat tham so ma hoa"
MCHelpSwMLP                    "\n mlp  Su dung cac trang bo nho lon"
MCHelpSwMS                     "\n  ms[ext;ext]   Chi ro nhung loai tap tin de nen"
MCHelpSwMT                     "\n  mt<luong>     Dat so luong"
MCHelpSwN                      "\n  n<tap tin>    Dong thoi loc cac tap tin duoc bao gom"
MCHelpSwNa                     "\n  n@            Doc cac mat na loc bo sung tu stdin"
MCHelpSwNal                    "\n  n@<ds>        Doc cac mat na loc bo sung tu tap tin danh sach"
MCHelpSwO                      "\n  o[+|-]        Dat che do ghi de"
MCHelpSwOC                     "\n  oc            Dat thuoc tinh Nen NTFS"
MCHelpSwOH                     "\n  oh            Luu cac lien ket cung duoi dang lien ket thay vi tap tin"
MCHelpSwOI                     "\n  oi[0-4][:min] Luu cac tap tin tuong dong duoi dang tham chieu"
MCHelpSwOL                     "\n  ol[a]         Xu ly cac lien ket tuong trung duoi dang lien ket [cac duong dan tuyet doi]"
MCHelpSwOM                     "\n om[-|1][=lst] Tuyen truyen trang web"
MCHelpSwONI                    "\n  oni           Cho phep cac ten co kha nang khong tuong thich"
MCHelpSwOP                     "\n  op<path>      Dat duong dan ra cho giai nen"
MCHelpSwOR                     "\n  or            Tu dong doi ten cac tap tin"
MCHelpSwOS                     "\n  os            Luu cac dong NTFS"
MCHelpSwOW                     "\n  ow            Luu hay phuc hoi chu hay nhom tap tin"
MCHelpSwP                      "\n  p[mat khau]   Dat mat khau"
MCHelpSwQO                     "\n  qo[-|+]       Them thong tin mo nhanh [khong|bat buoc]"
MCHelpSwR                      "\n  r             De quy cac thu muc con"
MCHelpSwRm                     "\n  r-            Vo hieu de quy"
MCHelpSwR0                     "\n  r0            Chi de quy cac thu muc con cho cac ten dai dien"
MCHelpSwRI                     "\n  ri<P>[:<S>]   Dat quyen uu tien (0-mac dinh,1-min..15-max) va thoi gian nghi theo ms"
MCHelpSwRR                     "\n  rr[N]         Them ban ghi phuc hoi du lieu"
MCHelpSwRV                     "\n  rv[N]         Tao nhung phan phuc hoi"
MCHelpSwS                      "\n  s[<N>,v[-],e] Tao tap tin nen dac"
MCHelpSwSm                     "\n  s-            Vo hieu nen dac"
MCHelpSwSC                     "\n  sc<chr>[obj]  Chi ro bo ky tu"
MCHelpSwSFX                    "\n  sfx[ten]      Tao tap tin nen SFX"
MCHelpSwSI                     "\n  si[ten]       Doc du lieu tu dau vao chuan (stdin)"
MCHelpSwSL                     "\n  sl<kich thuoc> Xu ly cac tap tin voi kich thuoc nho hon duoc chi ro"
MCHelpSwSM                     "\n  sm<kich thuoc> Xu ly cac tap tin voi kich thuoc lon hon duoc chi ro"
MCHelpSwT                      "\n  t             Kiem tra cac tap tin sau khi nen"
MCHelpSwTK                     "\n  tk            Giu thoi gian tap tin nen goc"
MCHelpSwTL                     "\n  tl            Dat thoi gian tap tin nen thanh tap tin moi nhat"
MCHelpSwTN                     "\n  tn<thoi gian> Xu ly cac tap tin moi hon <thoi gian>"
MCHelpSwTO                     "\n  to<thoi gian> Xu ly cac tap tin cu hon <thoi gian>"
MCHelpSwTA                     "\n  ta<ngay>      Xu ly cac tap tin duoc chinh sua sau <ngay> theo dinh dang YYYYMMDDHHMMSS"
MCHelpSwTB                     "\n  tb<ngay>      Xu ly cac tap tin duoc chinh sua truoc <ngay> theo dinh dang YYYYMMDDHHMMSS"
MCHelpSwTS                     "\n  ts<m,c,a>[N]  Luu hoac phuc hoi thoi gian tap tin (chinh sua, tao thanh, truy cap)"
MCHelpSwU                      "\n  u             Cap nhat cac tap tin"
MCHelpSwV                      "\n  v             Tao cac phan voi kich thuoc tu dong phat hien hay liet ke tat ca cac phan"
MCHelpSwVUnr                   "\n  v             Liet ke tat ca cac phan"
MCHelpSwVn                     "\n  v<kt>[k,b]    Tao cac phan voi kich thuoc=<kt>*1000 [*1024, *1]"
MCHelpSwVD                     "\n  vd            Xoa noi dung dia truoc khi tao phan"
MCHelpSwVER                    "\n  ver[n]        Dieu khien phien ban tap tin"
MCHelpSwVP                     "\n  vp            Tam dung truoc moi phan"
MCHelpSwW                      "\n  w<dd>         Gan thu muc lam viec"
MCHelpSwX                      "\n  x<tap tin>    Loai tru tap tin duoc chi ro"
MCHelpSwXa                     "\n  x@            Doc cac ten tap tin de loai tru tu stdin"
MCHelpSwXal                    "\n  x@<ds>        Loai tru cac tap tin duoc chi ro trong tap tin danh sach"
MCHelpSwY                      "\n  y             Gia thiet Co cho tat ca cac truy van"
MCHelpSwZ                      "\n  z[tap tin]    Doc chu thich tap tin nen tu tap tin"
MBadArc                        "\nLOI: Tap tin nen xau %s\n"
MAskPsw                        "Nhap mat khau (se khong bi lap lai)"
MAskPswFor                     "\nNhap mat khau (se khong bi lap lai) cho %s: "
MReAskPsw                      "\nNhap lai mat khau: "
MNotMatchPsw                   "\nLOI: Mat khau khong giong nhau\n"
MErrWrite                      "Loi ghi o tap tin %s"
MErrRead                       "Loi doc o tap tin %s"
MErrSeek                       "Loi tim kiem o tap tin %s"
MErrFClose                     "Khong the dong tap tin %s"
MErrOutMem                     "Khong du bo nho"
MErrBrokenArc                  "Tap tin nen hong - su dung lenh 'Sua chua'"
MProgAborted                   "Chuong trinh da huy"
MErrRename                     "\nKhong the doi ten %s thanh %s"
MAbsNextVol                    "\nKhong tim thay phan %s"
MBreak                         "\nNguoi dung ngat\n"
MAskCreatVol                   "\nTao phan tiep theo ?"
MAskNextDisk                   "\nO dia day. Chen dia tiep theo"
MCreatVol                      "\n\nDang tao tap tin nen%s %s\n"
MAskNextVol                    "\nChen dia voi %s"
MTestVol                       "\n\nDang kiem tra tap tin nen %s\n"
MExtrVol                       "\n\nDang giai nen tu %s\n"
MConverting                    "\nDang chuyen doi %s"
MCvtToSFX                      "\nChuyen doi tap tin nen thanh SFX"
MCvtFromSFX                    "\nDang loai bo module SFX"
MNotSFX                        "\n%s khong phai la tap tin nen SFX"
MNotRAR                        "\n%s khong phai la tap tin nen RAR"
MNotFirstVol                   "\n%s khong phai la phan dau tien"
MCvtOldFormat                  "\n%s - khong the chuyen doi sang tap tin nen SFX voi dinh dang cu"
MCannotCreate                  "\nKhong the tao %s"
MCannotOpen                    "\nKhong the mo %s"
MUnknownMeth                   "\nPhuong phap chua biet trong %s"
MNewRarFormat                  "\nDinh dang tap tin nen khong duoc ho tro. Xin hay cap nhat RAR toi mot phien ban moi hon."
MOk                            " Dong y"
MDone                          "\nHoan tat"
MLockingArc                    "\nDang khoa tap tin nen"
MNotMdfOld                     "\n\nLOI: Khong the chinh sua tap tin nen dinh dang cu"
MNotMdfLock                    "\n\nLOI: Tap tin nen da khoa"
MNotMdfVol                     "\n\nLOI: Khong the chinh sua phan"
MPackAskReg                    "\nPhien ban danh gia. Xin hay dang ky.\n"
MCreateArchive                 "\nDang tao tap tin nen%s %s\n"
MUpdateArchive                 "\nDang cap nhat tap tin nen%s %s\n"
MAddSolid                      "dac"
MAddFile                       "\nDang them    %-58s    "
MUpdFile                       "\nDang cap nhat  %-58s  "
MAddPoints                     "\n...       %-58s     "
MMoveDelFiles                  "\n\nDang xoa tap tin %s..."
MMoveDelDirs                   "va cac thu muc"
MMoveDelFile                   "\nDang xoa %-30s"
MMoveDeleted                   "    da xoa"
MMoveNotDeleted                "    KHONG XOA"
MClearAttrib                   "\n\nDang xoa thuoc tinh..."
MMoveDelDir                    "\nDang xoa thu muc %-30s"
MWarErrFOpen                   "\nCANH BAO: Khong the mo %d %s"
MErrOpenFiles                  "tap tin"
MErrOpenFile                   "tap tin"
MAddNoFiles                    "\nCANH BAO: Khong co tap tin nao"
MMdfEncrSol                    "\n%s: da ma hoa"
MAddAnalyze                    "\nDang phan tich cac tap tin da nen: "
MRepacking                     "\nDang nen lai cac tap tin da nen: "
MCRCFailed                     "\n%-20s - loi tong kiem tra"
MExtrTest                      "\n\nDang kiem tra tap tin nen %s\n"
MExtracting                    "\n\nDang giai nen tu %s\n"
MUseCurPsw                     "\n%s - su dung mat khau hien tai ?"
MCreatDir                      "\nDang tao    %-56s"
MExtrSkipFile                  "\nDang bo qua    %-56s"
MExtrTestFile                  "\nDang kiem tra     %-56s"
MExtrFile                      "\nDang giai nen  %-56s"
MExtrPoints                    "\n...         %-56s"
MExtrErrMkDir                  "\nKhong the tao thu muc %s"
MExtrPrinting                  "\n------ Dang in %s\n\n"
MEncrBadCRC                    "\nLoi tong kiem tra trong tap tin da ma hoa %s. Tap tin bi hong hoac sai mat khau."
MExtrNoFiles                   "\nKhong co tap tin nao de giai nen"
MExtrAllOk                     "\nTat ca On"
MExtrTotalErr                  "\nTong loi: %ld"
MAskReplace                    "\n\nBan co muon thay the tap tin da co %s\n%6s byte, duoc chinh sua luc %s\nvoi cai moi\n%6s byte, duoc chinh sua luc %s\n"
MAskOverwrite                  "\nGhi de %s ?"
MAskNewName                    "\nNhap ten moi: "
MHeaderBroken                  "\nTim thay dau muc hong"
MMainHeaderBroken              "\nDau muc tap tin nen chinh bi hong"
MLogFileHead                   "\n%s - dau muc tap tin bi hong"
MLogProtectHead                "Dau muc phuc hoi du lieu bi hong"
MArcComment                    "\nChu thich"
MReadStdinCmt                  "\nDang doc chu thich tu stdin\n"
MReadCommFrom                  "\nDang doc chu thich tu %s"
MDelComment                    "\nDang xoa chu thich tu %s"
MAddComment                    "\nDang them chu thich vao %s"
MLogCommBrk                    "\nChu thich tap tin nen bi hong"
MCommAskCont                   "\nNhan 'Enter' de tiep tuc hoac 'Q' de thoat:"
MWriteCommTo                   "\nGhi chu thich tap tin ra %s"
MCommNotPres                   "\nChu thich khong co"
MDelFrom                       "\nDang xoa khoi %s"
MDeleting                      "\nDang xoa %s"
MEraseArc                      "\nDang xoa tap tin nen rong %s"
MNoDelFiles                    "\nKhong co tap tin nao de xoa"
MLogTitle                      "--------  %2d %s %d, tap tin nen %s"
MPathTooLong                   "\nLOI: Duong dan qua dai\n"
MListArchive                   "Tap tin nen"
MListDetails                   "Chi tiet"
MListSolid                     "dac"
MListSFX                       "SFX"
MListVolume                    "phan"
MListRR                        "ban ghi phuc hoi"
MListLock                      "khoa"
MListEnc                       "da ma hoa"
MListEncHead                   "cac dau muc da ma hoa"

; Titles for 'L' and 'V' commands.
MListTitleL                    " Thuoc tinh Kich thuoc    Ngay     Gio   Ten"
MListTitleV                    " Thuoc tinh Kich thuoc  Da nen  Ti le    Ngay    Gio  Tongkiemtra  Ten"

; Titles for multiline list output.
MListName                      "Ten"
MListType                      "Loai"
MListFile                      "Tap tin"
MListDir                       "Thu muc"
MListUSymlink                  "Lien ket tuong trung Unix"
MListWSymlink                  "Lien ket tuong trung Windows"
MListJunction                  "Diem noi NTFS"
MListHardlink                  "Lien ket cung"
MListCopy                      "Tham chieu tap tin"
MListStream                    "Dong du lieu xen ke NTFS"
MListTarget                    "Dich"
MListSize                      "Kich thuoc"
MListPacked                    "Kich thuoc da nen"
MListRatio                     "Ty le"
MListMtime                     "mtime"
MListCtime                     "ctime"
MListAtime                     "atime"
MListModified                  "Sua"
MListCreated                   "Tao"
MListAccessed                  "Truy cap"
MListAttr                      "Thuoc tinh"
MListFlags                     "Co"
MListCompInfo                  "Nen"
MListHostOS                    "HDH Chu"
MListFileVer                   "Phien ban tap tin"
MListService                   "Dich vu"
MListNTACLHead                 "\n   da lieu bao mat NTFS"
MListStrmHead                  "\n   dong NTFS: %s"
MListUnkHead                   "\n   Loai dau muc chua biet: 0x%04x"
MYes                           "Co"
MNo                            "Khong"
MListNoFiles                   "  0 tap tin\n"
MRprReconstr                   "\nDang xay dung lai %s"
MRprBuild                      "\nDang xay dung %s"
MRprOldFormat                  "\nKhong the sua tap tin nen voi dinh dang cu"
MRprFind                       "\nTim thay  %s"
MRprAskIsSol                   "\nDau muc tap tin nen bi hong. Danh dau tap tin nen la dac ?"
MRprNoFiles                    "\nKhong tim thay tap tin nao"
MLogUnexpEOF                   "\nKet thuc tap tin nen bat ngo"
MRepAskReconst                 "\nXay dung lai cau truc tap tin nen ?"
MRRSearch                      "\nDang quet..."
MAnalyzeFileData               "\nPhan tich du lieu tap tin"
MRecRNotFound                  "\nKhong tim thay ban ghi phuc hoi du lieu"
MRecRFound                     "\nTim thay ban ghi phuc hoi du lieu"
MRecSecDamage                  "\nKhu vuc %ld (offsets %lX...%lX) bi hong"
MRecCorrected                  " - du lieu duoc phuc hoi"
MRecFailed                     " - khong the phuc hoi du lieu"
MAddRecRec                     "\nDang them ban ghi phuc hoi du lieu"
MEraseForVolume                "\n\nDang xoa noi dung cua o dia %c:\n"
MGetOwnersError                "\nCANH BAO: Khong the lay chu va nhom %s\n"
MErrGetOwnerID                 "\nCANH BAO: Khong the lay chu ID %s\n"
MErrGetGroupID                 "\nCANH BAO: Khong the lay nhom ID %s\n"
MOwnersBroken                  "\nLOI: Du lieu nhom va chu %s bi hong\n"
MSetOwnersError                "\nCANH BAO: Khong the dat chu va nhom %s\n"
MErrLnkRead                    "\nCANH BAO: Khong the doc lien ket tuong trung %s"
MSymLinkExists                 "\nCANH BAO: Lien ket tuong trung %s da ton tai"
MAskRetryCreate                "\nKhong the tao %s. Thu lai ?"
MDataBadCRC                    "\n%-20s : loi tong kiem tra du lieu da nen trong phan %s"
MFileRO                        "\n%s chi doc"
MACLGetError                   "\nCANH BAO: Khong the lay du lieu bao mat %s\n"
MACLSetError                   "\nCANH BAO: Khong the dat du lieu bao mat %s\n"
MACLBroken                     "\nLOI: Du lieu bao mat %s bi hong\n"
MACLUnknown                    "\nCANH BAO: Dinh dang chua biet cua du lieu bao mat %s\n"
MStreamBroken                  "\nLOI: Du lieu dong %s bi hong\n"
MStreamUnknown                 "\nCANH BAO: Dinh dang chua biet cua du lieu dong %s\n"
MInvalidName                   "\nLOI: Ten tap tin sai %s"
MProcessArc                    "\n\nXu ly tap tin nen %s"
MCorrectingName                "\nCANH BAO: Dang co gang sua ten tap tin sai"
MUnpCannotMerge                "\nCANH BAO: Ban phai giai nen tu phan truoc de giai nen %s"
MUnknownOption                 "\nLOI: Tuy chon chua biet: %s"
MSwSyntaxError                 "\nLOI: '-' duoc mong doi o dau: %s"
MSubHeadCorrupt                "\nLOI: Tim thay dau muc du lieu hong, da bo qua"
MSubHeadUnknown                "\nCANH BAO: Dinh dang dau muc du lieu chua biet, da bo qua"
MSubHeadDataCRC                "\nLOI: Khoi du lieu %s bi hong"
MScanError                     "\nKhong the doc noi dung cua %s"
MNotVolume                     "\n%s khong phai la mot phan"
MRecVolDiffSets                "\nLOI: %s va %s thuoc ve nhung tap hop khac nhau"
MRecVolMissing                 "\n%d phan bi thieu"
MRecVolFound                   "\n%d phan phuc hoi duoc tim thay"
MRecVolAllExist                "\nKhong co gi de xay dung lai"
MRecVolCannotFix               "\nKhong the xay dung lai"
MReconstructing                "\nDang xay dung lai..."
MCreating                      "\nDang tao %s"
MRenaming                      "\nDang doi ten %s thanh %s"
MNTFSRequired                  "\nLoi ghi: chi he thong tap tin NTFS moi ho tro cac tap tin lon hon 4 GB"
MFAT32Size                     "\nCANH BAO: He thong tap tin FAT32 khong ho tro cac tap tin 4 GB hoac lon hon"
MErrChangeAttr                 "\nCANH BAO: Khong the doi thuoc tinh cua %s"
MWrongSFXVer                   "\nLOI: module SFX mac dinh khong ho tro tap tin nen RAR %d.%d"
MHeadEncMismatch               "\nKhong the ma hoa tap tin nen co chua cac tap tin da duoc ma hoa"
MCannotEmail                   "\nKhong the gui email tap tin %s"
MCopyrightS                    "\nTap tin nen SFX RAR"
MSHelpCmd                      "\n\n<Cac lenh>"
MSHelpCmdE                     "\n  -x      Giai nen tu tap tin nen (mac dinh)"
MSHelpCmdT                     "\n  -t      Kiem tra cac tap tin da nen"
MSHelpCmdV                     "\n  -v      Liet ke chi tiet noi dung cua tap tin nen"
MRecVolLimit                   "\nTong so phan thong thuong va phuc hoi khong duoc vuot qua %d"
MVolumeNumber                  "phan %d"
MCannotDelete                  "\nKhong the xoa %s"
MRecycleFailed                 "\nKhong the xoa mot so tap tin va thu muc"
MCalcCRC                       "\nDang tinh toan tong kiem tra"
MTooLargeSFXArc                "\nCANH BAO: Tap tin nen SFX qua lon. Windows khong the chay tap tin thuc thi vuot qua 4 GB."
MCalcCRCAllVol                 "\nDang tinh toan cac tong kiem tra cua tat ca cac phan."
MNotEnoughDisk                 "\nLOI: Khong dua khoang trong dia cho %s."
MNewerRAR                      "\nBan co the can phien ban RAR moi hon."
MUnkEncMethod                  "\nPhuong phap ma hoa chua biet trong %s"
MWrongPassword                 "\nMat khau chi ro khong chinh xac."
MWrongFilePassword             "\nMat khau cho %s sai"
MAreaDamaged                   "\nHong %d byte tai %08x %08x"
MBlocksRecovered               "\n%u khoi duoc phuc hoi."
MRRDamaged                     "\nBan ghi phuc hoi bi hong."
MTestingRR                     "\nDang kiem tra ban ghi phuc hoi"
MFailed                        "That bai"
MIncompatSwitch                "\nKhoa %s khong duoc ho tro cho dinh dang tap tin nen RAR %d.x."
MSearchDupFiles                "\nDang tim cac tap tin tuong dong"
MNumFound                      "%d duoc tim thay."
MUnknownExtra                  "\nTruong mo rong chua biet trong %s."
MCorruptExtra                  "\nTruong mo rong bi hong %s trong %s."
MCopyError                     "\nKhong the sao chep %s den %s."
MCopyErrorHint                 "\nBan can giai nen toan bo tap tin nen de tao cac muc tham chieu tap tin."
MCopyingData                   "\nDang sao chep du lieu"
MErrCreateLnkS                 "\nKhong the tao lien ket tuong trung %s"
MErrCreateLnkH                 "\nKhong the tao lien ket cung %s"
MErrLnkTarget                  "\nBan can giai nen cac muc tieu cua lien ket."
MNeedAdmin                     "\nBan can chay RAR duoi quyen quan tri"
MDictOutMem                    "\nKhong du bo nho cho tu dien nen %d MB, doi thanh %d MB."
MUseSmalllerDict               "\nXin hay su dung mot tu dien nen nho hon."
MExtrDictOutMem                "\nKhong du bo nho giai nen tu dien nen %u GB."
MSuggest64bit                  "\nPhien ban RAR 64-bit la can thiet."
MOpenErrAtime                  "\nDe mo tap tin nay, ban can phai xoa khoa -tsp"
MErrReadInfo                   "\nChon "Bo qua" de tiep tuc voi phan da doc, "Bo qua tat ca" de tiep tuc neu co loi tuong tu, "Thu lai" de thu lai va "Thoat" de huy."
MErrReadTrunc                  "\n%s nen khong thanh cong do loi doc.\n"
MErrReadCount                  "\n%u tap tin nen khong thanh cong do loi doc.\n"
MDirNameExists                 "\nThu muc da ton tai"
MStdinNoInput                  "\nNhap ban phim khong duoc phep khi doc tu stdin"
MTruncPsw                      "\nMat khau vuot qua do dai toi da %u ky tu va sẽ bi cat bot."
MAdjustValue                   "\nChinh gia trị %s thanh %s."
MOpFailed                      "\nThao tac"
MSkipEncArc                    "\nBo qua tap tin nen duoc ma hoa %s"
MOrigName                      "Ten goc"
MOriginalTime                  "Thoi gian goc"
MFileRenamed                   "\n%s doi ten thanh %s"
MDictNotAllowed                "\n%u GB tu dien vuot gioi han %u GB va can them %u GB de giai nen."
MDictExtrAnyway                "\nDung nut chuyen -md%ug hoac -mdx%ug de giai nen."
MDictComprLimit                "\n%u GBtu dien vuot gioi han %u GB va khong duoc phep khi nen du lieu."
MNeedSFX64                     "\nMo-dun tu giai nen 64-bit la can thiet cho tu dien nen co dung luong %u GB."
MSkipUnsafeLink                "\nBo qua lien ket %s -> %s co nguy co khong an toan. Doi voi cac tep nen co nguon tin cay, hay dung -ola de giai nen."
MTruncService                  "\ nBi cat dich vu khoi: %s"
MHeaderQO                      "Thong tin mo nhanh"
MHeaderRR                      "Ho so phuc hoi"
MLockInMemoryNeeded            "-mlp Chuyen dac quyen \" khoa trang trong bo nho \" uu tien. Ban co muon gan cho tai khoan hien tai khong?"
MPrivilegeAssigned             "Dac quyen cua nguoi dung da duoc gan va se kich hoat sau khi Windows khoi dong lai. Khoi dong lai ngay?"


